#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

// обработки
Перем КонтекстЯдра;
Перем Утверждения;
Перем Ожидаем;

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт 
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	
	// подключение дополнительных обработок
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт 
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.Добавить("ТестДолжен_ПроверитьНаличиеРеквизитовРТУ");		
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт 
	НачатьТранзакцию();	
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт 
	
	Если ТранзакцияАктивна() Тогда
	    ОтменитьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#Область ЮнитТесты

Процедура ТестДолжен_ПроверитьНаличиеРеквизитовРТУ() Экспорт
	
	_РеквизитыРТУ  = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты;
	_Водитель = _РеквизитыРТУ.Найти("uni_Водитель");
	_Автотранспорт = _РеквизитыРТУ.Найти("uni_Автотранспорт");
	
	Ожидаем.Что(_Водитель).Не_().ЭтоНеопределено();
	Ожидаем.Что(_Автотранспорт).Не_().ЭтоНеопределено();
	
	
КонецПроцедуры



#КонецОбласти 


#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти
    
#Иначе
 ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли